


def calculate_electricity_cost(unit):
    if unit > 200:
       cost = (2.50 * 50) + (3.00 * 50) + (100 * 3.50) + ((unit - 200 ) * 4.00) + 25
       print(" ค่าบริการ : 25.00 บาท ")
       print("1-50 หน่วย: 125.00 บาท")
       print("51-100 หน่วย : 150.00 บาท")
       print("101-200 หน่วย : 350.00 บาท")
       print(" ค่าบริการ : 1")
       print("รวมค่าไฟทั้งสิ้น", cost)

    elif unit <= 101:  
        cost = (2.50 * 50) + (3.00 * 50) + (100 * 3.50) + ((unit - 100 ) * 3.50) + 25
        print(" ค่าบริการ : 25.00 บาท ")
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย : 150.00 บาท")
        print("รวมค่าไฟทั้งสิ้น", cost)

    elif unit <= 51:
        cost = (2.50 * 50) + (3.00 * 50) + (100 * 3.50) + ((unit - 50 ) * 3.00) + 25
        print(" ค่าบริการ : 25.00 บาท ")
        print("1-50 หน่วย: 125.00 บาท")
        print("รวมค่าไฟทั้งสิ้น", cost)

    elif unit <= 0:
            cost = (2.50 * 50) + (3.00 * 50) + (100 * 3.50) + ((unit - 50 ) * 2.50) + 25
            print(" ค่าบริการ : 25.00 บาท ")
            print("รวมค่าไฟทั้งสิ้น", cost)

while True:      
    print(" ===== โปรแกรมคำนวณค่าไฟ้า ===== ")
    print("1. คำนวณค่าไฟ ")
    print("2. ออกจากโปรแกรม ")
    choice = input("เลือกเมนู : ")
    if choice == '1':
        unit = float(input(" กรอกจำนวนหน่วยไฟฟ้า : "))
        calculate_electricity_cost(unit)  
    elif choice == '2':
        break
else:
    print("ไม่มีเมนู")





    