'''ขอให้สร้าง function ชื่อ deposit(money) ที่เป็นโปรแกรมจำลองการฝากเงินเข้าบัญชี โดยกำหนดยอดเงินเริ่มต้นเป็น 1,000 บาท โปรแกรมต้องรับจำนวนเงินที่ต้องการฝากจากผู้ใช้ 1 ครั้ง แล้วคำนวณยอดคงเหลือใหม่

ใช้ try-except เพื่อจัดการกรณีผู้ใช้กรอกข้อมูลที่แปลงเป็นตัวเลขไม่ได้ เช่น abc
หากจำนวนเงินฝากน้อยกว่าหรือเท่ากับ 0 ให้ใช้ raise ValueError พร้อมข้อความ จำนวนเงินฝากต้องมากกว่า 0
หากข้อมูลถูกต้อง ให้ใช้ else แสดงยอดเงินคงเหลือใหม่
ใช้ finally แสดงข้อความ สิ้นสุดรายการฝากเงิน เสมอ
ห้ามใช้ except: แบบไม่ระบุชนิดข้อผิดพลาด '''


def deposit(money):
    start_money = 1000
    print("ยอดเงินเริ่มต้น :", start_money, "บาท")

    try:
        money = float(money)

        if money <= 0:
            raise ValueError("จำนวนเงินฝากต้องมากกว่า 0")

        start_money = start_money + money

    except ValueError as error:
        print("เกิดข้อผิดพลาด :", error)

    else:
        print("ฝากเงินสำเร็จ")
        print("ยอดเงินคงเหลือ: %.2f บาท" % start_money)

    finally:
        print("สิ้นสุดการฝากเงิน")


money = input("กรอกจำนวนเงินที่ต้องการฝาก: ")
deposit(money)
